<template>
	<view class="container" style="background-color: #f1f1f1;">
		<view class="card">
			<h3 class="text-center pb-10 pt-20">用户服务协议</h3>
			<p>协议版本:[1.0] ; 发布/生效日期: [2023年5月25日]</p>
			<text style="font-size: 12upx;">
				智慧社区项目服务时的权利和义务。在使用我们的服务前，请您仔细阅读并理解以下协议条款：
				<br>
				一、服务条款
				<br>
				1.1 服务内容
				<br>
				我们向您提供智慧社区服务，包括但不限于：
				
				提供社区信息发布功能，为社区居民提供便捷的信息查询和发布服务；
				提供物业缴费、报修等服务；
				提供社区活动组织、报名与参与服务。
				<br>
				1.2 服务变更与服务费用
				
				我们可能会基于业务发展需要，对提供的服务内容进行调整、更新或者增加新的服务。在服务变更时，我们将会在合理期限内提前告知您并尽力减少服务变更对您的影响。
				
				对于收费服务，我们将依照公示的价格向您收取费用。我们保留因业务调整、技术变化或其他原因适时更改服务收费标准、方式的权利，将会在合理期限内通知您。
				<br>
				二、用户账户
				<br>
				2.1 注册账户
				
				在使用智慧社区服务前，需要您注册并开通与您个人身份相对应的账户，完成注册即表示您已同意并遵守本协议的规定。
				<br>
				2.2 账户安全
				
				请您妥善保管账户及账户密码，不得将账户授权或转让给他人使用，若因密码泄露或账户授权导致的损失均由用户自行承担。
				<br>
				2.3 账户注销
				
				如您不需要继续使用智慧社区服务，可通过注销方式注销您的账户。账户注销后，您的账户将不可恢复。
				<br>
				三、用户行为规范
				<br>
				3.1 合法合规
				
				在使用智慧社区服务过程中，您必须遵守中国相关法律法规，不得以任何形式从事任何非法活动，包括但不限于：
				
				发布、传播违法、淫秽、妨害社会公共利益或其他不当信息；
				使用智慧社区服务从事任何诈骗、恶意攻击、侵犯他人权益等行为；
				破坏智慧社区服务的技术措施或正常运营。
				<br>
				3.2 保护个人信息
				
				在使用智慧社区服务过程中，我们将收集您的个人信息，为了保护您的隐私，您需要：
				
				填写真实、准确、完整的个人信息；
				妥善保管您的账户和密码，避免个人信息泄露；
				未经他人同意，不得获取、使用、向他人提供他人的个人信息。
				<br>
				3.3 用户内容
				
				您可在智慧社区服务中发布、展示、传播信息、文字、图片、音频、视频等用户内容。您提交的用户内容须符合中国相关法律法规和本协议的规定，不得侵犯他人合法权益，包括但不限于：
				
				侵犯他人著作权、商标权、专利权等知识产权；
				侵犯他人姓名权、肖像权、隐私权等人格权；
				包含恶意软件、病毒、广告等一切有害的信息内容。
				<br>
				四、知识产权
				<br>
				4.1 智慧社区知识产权
				
				智慧社区服务中所有文字、图片、音频、视频等内容的知识产权归智慧社区所有。
				<br>
				4.2 用户内容的知识产权
				
				您发布、展示、传播的用户内容的知识产权归您所有。但是，您同意授予智慧社区在全球范围内、免费、不可撤销的许可使用的权利，包括但不限于：
				
				在智慧社区服务中展示、传播您的用户内容；
				以向公众展示、传播、复制、修改、出版或制作衍生作品的形式使用您的用户内容。
				<br>
				五、免责声明
				
				由于以下原因导致您在使用智慧社区服务过程中受到任何损失，我们将不承担任何责任：
				
				因天灾、社会事件、互联网原因和其他不可抗力因素导致服务中断、停止；
				您违反本协议规定或者因自身原因发生的任何损失。
				<br>
				六、协议更新
				
				我们有权基于业务发展需要随时修改本协议。修改后的协议将在智慧社区服务页面公示，您可以随时查看最新版协议内容。
				<br>
				七、法律适用
				
				本协议应适用中华人民共和国法律，如本协议中任何条款与中国现行法律相抵触，则该条款将按法律规定重新解释，但不影响其他条款的法律效力。
				<br>
				八、争议解决
				
				因本协议引起的或与本协议有关的任何争议，双方应友好协商解决。协商不成的，任何一方均可向本协议签订地有管辖权的人民法院提起诉讼。
				
				以上为用户协议的全部内容，如您有任何疑问，请随时联系我们。
				
				
			</text>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				
			}
		},
		methods: {
			
		}
	}
</script>

<style>
	.card{
		
		width: 97%;
		margin: 10upx 10upx 0upx 10upx;
		margin-top: 10upx;
		background-color: #ffffff;
	}
	.container{
		padding-top: 10upx;
		width: 100%;
		height: fit-content;
	}
	p{
		font-size: 14upx;
		text-align: center;
		padding-bottom: 10upx;
	}
	
</style>
