<template>
	<view class="container" style="background-color: #f1f1f1;">
		<view class="card">
			<h3 class="text-center pb-10 pt-20">隐私政策</h3>
			<text style="font-size: 12upx;">
				
				
				感谢您使用智慧社区项目服务！我们非常重视您的隐私保护，为保障您的权益和安全，制定本隐私政策协议，阐述我们收集、使用、共享、存储您的个人信息的相关规定和措施。请您仔细阅读并理解此协议，如有疑问，请及时联系我们。
				<br>
				一、适用范围
				
				本隐私政策适用于您使用智慧社区项目服务过程中，我们在服务中收集、使用和存储的您的个人信息。
				<br>
				二、所收集的信息
				
				我们将会收集、存储的信息有：
				
				在您使用智慧社区项目时，我们可能会收集您提供的个人信息，包括但不限于姓名、联系方式、住址等；
				
				在您使用智慧社区项目时，我们可能会自动收集您的设备信息，包括但不限于设备型号、操作系统、浏览器类型、网络服务提供商（ISP）、IP地址等信息；
				
				在您使用智慧社区项目时，我们可能会自动收集您在服务中的操作行为数据，包括但不限于浏览记录、交互记录等；
				
				我们可能会收集您在使用智慧社区项目服务时提交的相关信息和建议，帮助我们完善和改进服务。
				<br>
				三、所收集信息的用途
				
				我们收集、存储您的个人信息，基于以下用途：
				
				为向您提供服务所必要的功能和内容，且为了满足经济和法律义务所需，或者为了保护您的权益和财产安全；
				
				您同意我们可能向您发送有关智慧社区项目的更新和相关信息，或者对您反馈的问题和建议进行回复；
				
				为改进和优化我们的产品和服务质量，开发新产品和服务。
				<br>
				四、信息的保护和共享
				
				我们将采用安全技术和措施，保障您的个人信息。
				
				我们不会将您的个人信息出售给第三方。我们未经您事先同意不会与未经认证的第三方共享您的个人信息。
				
				我们可能会将您的个人信息分享给以下第三方：
				
				我们授权的代表和服务提供商，包括但不限于为了协助我们处理支付、交付、客户服务、市场营销和数据分析等服务相关的目的，提供的技术服务及其他支持服务；
				
				根据您的要求和授权情况下向您提供的第三方服务提供商。
				
				我们会尽最大努力确保任何我们与之共享信息的第三方都采取适当的信息保护措施并与我们签署保密协议，同时受本政策的约束和保护。
				<br>
				五、信息存储和管理
				
				我们将在符合相关法律法规要求的期限内保留您的个人信息，法律法规另有规定的除外。
				<br>
				六、更改和删除个人信息
				
				您有权更改个人信息，包括但不限于姓名、联系方式、住址信息等。如果您需要更改您的个人信息，请与我们联系。
				
				在符合相关法律法规要求的情况下，我们也将为您提供访问、更正、删除、限制、收回和移动数据的权利。若您认为智慧社区项目的个人信息处理行为侵犯了您的权利，您有权向我们提出异议或申诉我们的行为。
				<br>
				七、法律适用和争议解决
				
				本隐私政策适用中国法律。因本协议所产生的任何法律纠纷，双方应共同协商解决。协商不成的，任何一方均可向协议签订地的有管辖权的人民法院提起诉讼。
				<br>
				八、协议的更新和通知
				
				我们会定期公布本隐私政策，并以适当的方式及时通知您重要变更。如您继续使用我们的服务，即表示您接受修订后的隐私政策并同意按照隐私政策收集、使用和存储您的个人信息。
				
				如果您不同意本隐私政策的任何条款，或您不愿意接受本隐私政策的更新版本，请您立即停止使用智慧社区项目的服务。
			</text>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				
			}
		},
		methods: {
			
		}
	}
</script>

<style>
	.card{
		
		width: 97%;
		margin: 10upx 10upx 0upx 10upx;
		margin-top: 10upx;
		background-color: #ffffff;
	}
	.container{
		padding-top: 10upx;
		width: 100%;
		height: fit-content;
	}
	
	
</style>
